; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p2---int100n150-m25---int100c110---s1---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level16 level16)
(sum level0 level23 level23)
(sum level1 level3 level4)
(sum level1 level16 level17)
(sum level1 level23 level24)
(sum level2 level3 level5)
(sum level2 level16 level18)
(sum level2 level23 level25)
(sum level3 level3 level6)
(sum level3 level16 level19)
(sum level3 level23 level26)
(sum level4 level3 level7)
(sum level4 level16 level20)
(sum level4 level23 level27)
(sum level5 level3 level8)
(sum level5 level16 level21)
(sum level5 level23 level28)
(sum level6 level3 level9)
(sum level6 level16 level22)
(sum level6 level23 level29)
(sum level7 level3 level10)
(sum level7 level16 level23)
(sum level7 level23 level30)
(sum level8 level3 level11)
(sum level8 level16 level24)
(sum level8 level23 level31)
(sum level9 level3 level12)
(sum level9 level16 level25)
(sum level9 level23 level32)
(sum level10 level3 level13)
(sum level10 level16 level26)
(sum level10 level23 level33)
(sum level11 level3 level14)
(sum level11 level16 level27)
(sum level11 level23 level34)
(sum level12 level3 level15)
(sum level12 level16 level28)
(sum level12 level23 level35)
(sum level13 level3 level16)
(sum level13 level16 level29)
(sum level13 level23 level36)
(sum level14 level3 level17)
(sum level14 level16 level30)
(sum level14 level23 level37)
(sum level15 level3 level18)
(sum level15 level16 level31)
(sum level15 level23 level38)
(sum level16 level3 level19)
(sum level16 level16 level32)
(sum level16 level23 level39)
(sum level17 level3 level20)
(sum level17 level16 level33)
(sum level17 level23 level40)
(sum level18 level3 level21)
(sum level18 level16 level34)
(sum level18 level23 level41)
(sum level19 level3 level22)
(sum level19 level16 level35)
(sum level20 level3 level23)
(sum level20 level16 level36)
(sum level21 level3 level24)
(sum level21 level16 level37)
(sum level22 level3 level25)
(sum level22 level16 level38)
(sum level23 level3 level26)
(sum level23 level16 level39)
(sum level24 level3 level27)
(sum level24 level16 level40)
(sum level25 level3 level28)
(sum level25 level16 level41)
(sum level26 level3 level29)
(sum level27 level3 level30)
(sum level28 level3 level31)
(sum level29 level3 level32)
(sum level30 level3 level33)
(sum level31 level3 level34)
(sum level32 level3 level35)
(sum level33 level3 level36)
(sum level34 level3 level37)
(sum level35 level3 level38)
(sum level36 level3 level39)
(sum level37 level3 level40)
(sum level38 level3 level41)

(connected l0 l1)
(fuelcost level16 l0 l1)
(connected l0 l2)
(fuelcost level23 l0 l2)
(connected l1 l0)
(fuelcost level16 l1 l0)
(connected l1 l2)
(fuelcost level3 l1 l2)
(connected l2 l0)
(fuelcost level23 l2 l0)
(connected l2 l1)
(fuelcost level3 l2 l1)

(at t0 l0)
(fuel t0 level41)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
)

(:goal
(and
(at p0 l0)
(at p1 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l0 l1 level25 level16 level41)
   deleted: (at t0 l0) (fuel t0 level41)
   added: (at t0 l1) (fuel t0 level25)
   goals met: 0 of 2
2. (drive t0 l1 l2 level22 level3 level25)
   deleted: (at t0 l1) (fuel t0 level25)
   added: (at t0 l2) (fuel t0 level22)
   goals met: 0 of 2
3. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 2
4. (drive t0 l2 l1 level19 level3 level22)
   deleted: (at t0 l2) (fuel t0 level22)
   added: (at t0 l1) (fuel t0 level19)
   goals met: 0 of 2
5. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 2
6. (drive t0 l1 l0 level3 level16 level19)
   deleted: (at t0 l1) (fuel t0 level19)
   added: (at t0 l0) (fuel t0 level3)
   goals met: 0 of 2
7. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 1 of 2
8. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 2 of 2
